tutorials/Aerodynamics/CRM_Wing_Body_Tail/run/system/controlDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


libs
(
    "libbuoyantPressureFvPatchScalarField.so" 
    "libDummyTurbulenceModelCompressible.so" 
    "libSpalartAllmarasFv3Compressible.so" 
);

application     rhoSimpleCDAFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;
deltaT          1;
writeControl    timeStep;
writeInterval   2000;
purgeWrite      0;
writeFormat     ascii;
writePrecision  16;
writeCompression on;
timeFormat      general;
timePrecision   16;
runTimeModifiable true;

functions
{ 
    forceCoeffs
    { 
        type                forceCoeffs;
        libs                ("libforces.so");
        writeControl        timeStep;
        timeInterval        1;
        log                 yes;
        patches             (wing tail body);
        pName               p;
        UName               U;
        rho                 rhoInf;
        rhoInf              1.176829;
        dragDir             (0.9993313919 0.0000000000 0.0365618553);
        liftDir             (-0.0365618553 0.0000000000 0.9993313919);
        CofR                (33.677860 11.906250 4.519930);
        pitchAxis           (0 1 0);
        magUInf             295.000000;
        lRef                7.005320;
        Aref                191.844778;
    } 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
